{
    "csse": [
        {
            "time": "1:00 PM - 1:15 PM",
            "projectId": "csse-5-100",
            "title": "CourseXpo: Digital Learning",
            "studentName": "River Hill",
            "studentMajor": "CSSE",
            "projectType": "CSS Faculty Research",
            "facultyAdvisor": "Dr. Kelvin Sung",
            "posterLink": "./posters/csse/hill-river.png",
            "abstract": "Digital learning is not a new idea; it has been around since the beginning of the internet. The ways in which we teach online, however, have evolved over the years. During the pandemic, the leading tool that teachers have for delivering course content remotely has been Zoom. It proved to be helpful and essential in ensuring that students’ education could continue in a fully online learning environment. However, it is also the case that Zoom struggles to keep students immersed and engaged and cannot fully replace an in-person learning experience. Because of this, collaborative learning is also difficult to achieve.\n\nIn our capstone project, my team and I aimed to address these issues by expanding results from a previous capstone project and creating a new type of remote learning environment that would ensure students’ immersion, engagement, and ability to collaborate with other students. The previous results were the basics of an online space, in which students could connect and learn course content together at their own pace.\n\nThe main issues we examined first were immersion and engagement; by expanding on how a user could customize their avatar, we found that immersion increased. Next, we added voice chat which helped users feel more engaged. The main collaborative features we added were the ability for users to take quizzes together; this expands upon the already created quiz booths, allowing users to discuss a question together before agreeing on a single answer. We also created canvases in which students can draw together.\n\nA skill that I gained and practiced during this capstone was learning how to work on an existing project with a group of other students. We were responsible for learning the details of the existing project and integrating our additions. Time management was also important during this project; my team and I had to create goals for ourselves, follow through, and report our results at weekly meetings, including demonstrating our progress with our faculty advisors.\n\nThe future of the Course Expo project will depend on the next group of students who join Professor Sung in his research. Our team provided a means for students to feel immersed and engaged when using the Course Expo, as well as adding the ability to collaborate with other students."
        },
        {
            "time": "1:15 PM - 1:30 PM",
            "projectId": "csse-5-115",
            "title": "Lecture Board Game",
            "studentName": "Daniel Kim",
            "studentMajor": "CSSE",
            "projectType": "CSS Faculty Research",
            "facultyAdvisor": "Dr. Kelvin Sung",
            "posterLink": "./posters/csse/kim-daniel.jpg",
            "abstract": "Schools had to move their education to online environments due to COVID-19 quarantine procedures. To accommodate for the downsides of remote learning, Dr. Kelvin Sung and Dr. Robin Angotti have led a faculty research group of undergraduates to develop unique applications that would help enhance the remote learning experience using the Augmented Space Library (ASL). One of the developed applications is the Board Quiz project.\n\nThe Board Quiz app is a virtual board game that students and teachers can participate in during regular online lectures. The app would allow teachers to post questions related to the lecture topic for the students to answer. It’s designed so that the students would be able to answer and self-grade the questions whenever they want. The primary objective of the gameplay for the students is to collect as many stars. When a question is marked as correct, they will gain 5 stars and one point to roll a dice that will determine how far they move on the board. To make the gameplay more intriguing, the game board also contains several special tiles for unique effects.\n\nThere are various benefits from using this application. This project serves to help students take notes and engage the students more into paying attention. When playing this game, the students will be more inclined to take notes so that they can answer the questions and earn stars. Also, the extra enjoyment from the gameplay will make them more invested in the material. During testing, the testers reported that they generally felt more inclined to pay attention to the lecture with the game. Supplementary to the gameplay, the application also provides a downloadable CSV file with performance statistics, which enables the teachers and students to review the questions.\n\nI worked on the gameplay and internal data parts of the game. I implemented each of the tile effects, player movement, game board set up, statistics and data management. The board tiles are represented by TileNodes that contain different data, and the special tiles are recognized by the TileNodes’ tags. A lot of the data manipulation was done by sending float arrays to all players’ applications in order to synchronize the values. Player movement was coded with a physical dice object that determined players’ location, and the movement of the player pieces are done with ASL’s claiming/setting object’s position methods."
        },
        {
            "time": "1:30 PM - 1:45 PM",
            "projectId": "csse-5-130",
            "title": "SWE Internship @ Microsoft",
            "studentName": "Aman Swaroop",
            "studentMajor": "CSSE",
            "projectType": "Internship - Microsoft",
            "facultyAdvisor": "Dr. Kelvin Sung",
            "posterLink": "./posters/csse/swaroop-aman.png",
            "abstract": "As a company, Microsoft is always trying to put their customers first and striving for the best and safest customer experiences inside of their products. During my summer working on the Azure DevOps team, I worked very closely with the Azure DevOps Intersect team trying to create a safer and more secure authentication scheme that customers could use inside of the Azure DevOps pipelines for Azure Container Registries to use.\n\nThe problem with the current authentication scheme is, at the backend, the product creates a service principal on the fly and stores the username and password in a strongbox. Users must rotate certificates manually after every 1 year when a connection is first set up with the current Azure Container Registry. This is both unsecure from Microsoft’s standpoint, and tedious from a user’s standpoint.\n\nThe solution that my mentor and I proposed was the introduction of Managed Identities to authenticate Azure Container Registries in the Azure DevOps experience. This way, users do not have to worry about secret rotations and Azure DevOps does not have to worry about storing secrets, because the entire notion of secrets will not exist.\n\nOn an important level, managed identities supply an identity for applications to use when connecting to resources that support Azure Active Directory authentication. Applications may use this managed identity service to obtain an Azure Active Directory token. We can later use this Azure Active Directory token and exchange this token to get an Azure Container Registry token which we will use to login to the Azure Container Registry service (using a docker login) so that users can authenticate themselves and pull/push images as they please. \n\nI have gone ahead and added support for Managed Identities in the DockerV2 task, and the container jobs within Azure DevOps. This means that if a user decides to configure a pipeline to use an Azure Container Registry to authenticate using Managed Identity, they did not have to worry about secret rotation.\n\nI am quite lucky and fortunate to have the opportunity that I had during the summer. I would like to thank my entire team for the opportunity that I had to learn and grow to become a better software engineer. I had lots of fun throughout the summer and all the successes that I had were from the support and culture of the team."
        },
        {
            "time": "1:45 PM - 2:00 PM",
            "projectId": "csse-5-145",
            "title": "Security Design Pattern Detection in Java Source Code",
            "studentName": "Martin Rudzis",
            "studentMajor": "CSSE",
            "projectType": "CSS Faculty Research",
            "facultyAdvisor": "Dr. Hazeline Asuncion",
            "posterLink": "./posters/csse/rudzis-martin.jpg",
            "abstract": "The focus of this research work is developing an automatic approach for detecting the presence of Security Design Patterns (SDPs) in Java source code. Design patterns play a significant role insoftware engineering, and in the case of SDPs, having the ability to easily verify their presence isparticularly useful, as SDPs often play a role in ensuring that a system’s security requirements are met. Manual identification of design patterns is a lengthy process, particularly for complex systems, so the development of an automatic detection approach enables faster, and perhaps more accurate, verification that security requirements are fulfilled.\n\nMy focus within the context of this research has been to assist in two main ways. First, the pattern detection approach depends on SPARQL queries that are run on NT files containing RDFmetadata about Java source code. Prior research found that queries would run out of memory when run on NT files generated from large Java projects (over 30,000 lines of code). My work has been to generate smaller NT files from sections of these projects to resolve this. Second, my work focused on improving SDP detection. For example, UML class diagrams required adjustment in some cases to more accurately detect SDPs, and further work and research was necessary to determine why queries were producing little results. \n\nMy results produced an approach for creating NT files from arbitrary sections of Java source code, enabling the creation of NT files from any part of a project as desired, and I personally succeeded in generating 72 NT files from sections of 7 different Java projects. This is important because this enables the prior out-of-memory issues to be mitigated. It was observed during the project that previously generated NT files included triples from external libraries, likely another cause of queries failing to execute. I additionally developed an approach for generating UML class diagrams from Java code, enabling visual comparison of SDPs diagrams to the source code.I also produced simple implementations of SDPs for query testing, running queries I generated from UML class diagrams on the NT files created from sections. Through this, I further discovered two apparent issues in the query generator tool, PatternScout, that have implications for the direction of future research and the process of creating UML class diagrams of SDPs."
        },
        {
            "time": "2:00 PM - 2:15 PM",
            "projectId": "csse-5-200",
            "title": "Detecting Security Design Patterns in Source Code",
            "studentName": "Alex Xiong",
            "studentMajor": "CSSE",
            "projectType": "CSS Faculty Research",
            "facultyAdvisor": "Dr. Hazeline Asuncion",
            "posterLink": "./posters/csse/xiong-alex.jpg",
            "abstract": "Cybersecurity attacks are currently evolving only to become more creative and dangerous. Thus, it is important that the security of software applications and other cybersecurity defenses are regularly maintained. Security design patterns ensure that the security requirements are satisfied during and after the software development process. The current goal of this research project is to detect security design patterns from source code. Since previous work has already been completed by past student researchers, the goal of my capstone project is to improve the overall methods of .nt and .rq file generation, both of which are needed to produce query results for security design pattern detection. The current problems faced in the research project is the lack or inaccuracy of query results, which can be traced back to both .nt and .rq file generation. \n\nPrevious research work includes .nt files with class dependencies created from parsing source code and .rq files created from security design pattern UML class diagrams. For further improvement of these methods, my tasks in this project include generating .jar files without class dependencies, reverse engineering UML class diagrams from open source projects, generating Java code from partial UML class diagrams, and analyzing 2 SPARQL query results. The process of my tasks used various software applications, including Intellij, Visual Paradigm, Codeontology, and Visual Studio Code. The extent of my tasks includes using the mentioned software applications to create improved files, and using precision and recall methods to effectively analyze the 2 SPARQL query results. By the end of this project, I was able to contribute to the improvement of the process by uploading 6 .nt files without class dependencies, 13 correct examples of UML class diagrams, 31 creating Java dummy code files for security design pattern detection testing, and identifying 0 true positives for the 2 query result files."
        },
        {
            "time": "2:15 PM - 2:30 PM",
            "projectId": "csse-5-215",
            "title": "Byte Dungeon - Virtual Online Tabletops Built with WebAssembly",
            "studentName": "Sebastion Colon",
            "studentMajor": "CSSE",
            "projectType": "Individual Project - Student Defined",
            "facultyAdvisor": "Dr. William Erdly",
            "posterLink": "./posters/csse/colon-sebastian.jpg",
            "abstract": "Imagine  using  your  favorite  desktop  application  at  near-native  performance  without needing to install a single file to your device; this has been the alluring promise WebAssembly suggests  with  its  unique  set  of  innovative  features.  WebAssembly  (commonly  shortened  to WASM) is an emergent binary instruction format that can compile native source code into low-level byte code that can be run and understood by all modern browsers. It has experienced widespread  adoption  due  to  the  sheer  amount  of  features  it  can  provide  to  web  browsing experiences.\n\nThe  goal  of  this  individual  capstone  project  is  to  create  a  robust  proof  of  concept demonstrating the ability to port high-performance, resource-intensive applications to the web with  the  help  of  WebAssembly.  Many  sites  have  already  experimented  with  porting  larger, more demanding applications like modern video games to the browser with the help of WASM. However, few sites have tried implementing an application as demanding as a video game, while also handling multiple concurrent users in the same session.\n\n I  undertook  full-stack  development  of  an  online  virtual  tabletop  application  primarily written in the Rust programming language by utilizing WebAssembly as the compilation target. I  chose  this  type  of  application  as  the  proof  of  concept  because  it  requires  balancing  the demand  for  speedy  data  concurrency,  memory  safety,  and  intense  graphical  and  logical calculations.  This  is  because  virtual  tabletops  made  for  pen-and-paper-style  role-playing games  require  the  storing  and  processing  of  large  amounts  of  data  to  represent  constantly changing characters, environments, rulesets and visuals for each game.\n\nDeveloping a site to simulate a virtual table-top gaming environment, where multiple users can connect to and synchronously test its ability to render complex graphics in real-time, process high volumes of user data with efficiency and reliability, and calculate intense game logic that can change from session to session offered me valuable insight into WebAssembly’s critical role in future of web development, as well as its glaring limitations that may hinder the further development of this technology."
        },
        {
            "time": "2:30 PM - 2:45 PM",
            "projectId": "csse-5-230",
            "title": "Scheduled Messages & Special Requests - Expedia SDE Full Stack Internship",
            "studentName": "Sidra Imran",
            "studentMajor": "CSSE",
            "projectType": "Individual Project - Student Defined",
            "facultyAdvisor": "Dr. William Erdly",
            "posterLink": "./posters/csse/imran-sidra.jpg",
            "abstract": "I’m inspired by Expedia’s disruptive mission to digitize the travel industry and how they’ve incorporated customer focus and company values across their SDLC. I’ve learned the importance of being agile to a changing environment, the power of building frictionless Cloud services, and promoting a culture of fearless experimentation. \n\nAgility: My key takeaway in building software is that you must respond quickly to everchanging priorities. I noticed teams at Expedia do not execute on static plans. Rather, they keep a pulse on customer usage and business needs. They accordingly prioritize and backlog work-items based on usage, traffic, and customer feedback. For instance, I was initially focused on Bulk Messaging but shifted gears to the Async-Create-Conversations Lamba based on business priorities. This gave me an opportunity to learn different domains and underlined the benefits of agility. \n\nPower of Cloud: My key learnings comprised of navigating and learning the various AWS services and how these services provide elasticity and scalability in helping store data, improve security, and iterative testing and deployments. I gained experience leveraging compute services with AWS EC2; storage with S3, functions with lambda, and queues with SQS. Learning these fundamentals of Amazon’s services helped me test my code while incorporating more secure solutions (ex. by possibly using Amazon’s Secrets Manager). \n\nFearless Experimentation: I came into the project with no experience in JavaScript and realized how fast I can learn by leveraging the tools around me. I read up on documentation, watched tutorials, reached out to teammates and was able to pick-up JavaScript within the week. This helped me realize the best way to learn is to be fearless and jump into territory you don’t know! I got the opportunity to learn the tools utilized in assessing our code by applying the same mantra: exploring Splunk for parsing through logs and debugging, spinnaker for deployment, and Postman to test our API. Changing the endpoint gave me the opportunity to see the interaction between the two systems and understand why SPCS is more optimal while pushing out and merging a PR.\n\n I learned how an endpoint can be changed by identifying the correct paths, environmental variables and the importance of logging/ processing events correctly in order to secure customer data. For securing data in SPCS and checking the auth-token I created one main method and called it twice under two “if statements” to reduce redundant code (rather than having two duplicate methods). "
        },
        {
            "time": "2:45 PM - 3:00 PM",
            "projectId": "csse-5-245",
            "title": "Software Engineering Internship @ Coupang",
            "studentName": "Alex Petrenko",
            "studentMajor": "CSSE",
            "projectType": "Internship - Coupang",
            "facultyAdvisor": "Dr. William Erdly",
            "posterLink": "./posters/csse/petrenko-oleksiy.jpg",
            "abstract": "Background\n\nDuring the summer of 2022, I underwent a 12-week long internship, in the role of a Software Development Engineer Intern at Coupang.\n\nWhy\n\nThe main revenue stream of Coupang is from their marketplace platform. The three main ways Coupang makes money is: through selling advertisements to the third-party sellers (anyone who’s using Coupang’s marketplace platform to sell their products), charging a percentage of the sale from third-party sellers, and selling their own products (where Coupang is the seller).Now, to maximize the profits from all of the above, we needed a special service for providing targeted advertisement suggestions to the users. Such service requires a well-trained ML model, or a set of models.This is where my project comes into play: by creating a process for ML models evaluation, our team would be able to develop a well-trained model without relying on A/B testing (which is what my team used before).\n\nResult\n\nI created a program for pulling data from various data-lakes and assembling hive tables of only the data that is required for replaying past-actions. I created a pipeline for moving this data from our S3 into a cluster that would process this data. I created another pipeline for replaying past-actions on our service for providing targeted advertisement suggestions. I then used the results from those replays to give a score to a given ML model. Finally, I created a program for running this process by using different ML models, which allowed me to evaluate different model performances on the same data-set.\n\nSignificance\n\nAs a result of my work, my team got the basis for performing offline ML model evaluations, ability to compare models against one another, and to rapidly develop new models, based on the scoring parameters used.\n\nMoreover, I made sure that my code is modular and extendable, which means that they can modify the scoring basis as they please, without spending much time.\n\nConclusion\n\nTo conclude, I learned many new technologies and practices. I had exposure to problems that arise when working with big-data and distributed systems. More importantly, I had a great time. Overall, I believe that this experience was not only beneficial to me, but also beneficial to my team, and to the company as a result."
        },
        {
            "time": "3:00 PM - 3:15 PM",
            "projectId": "csse-5-300",
            "title": "Test Engineer - Kent Space Center",
            "studentName": "Tyler Moore",
            "studentMajor": "CSSE",
            "projectType": "Intenrship - Boeing",
            "facultyAdvisor": "Dr. William Erdly",
            "posterLink": "./posters/csse/moore-tyler.png",
            "abstract": "This summer I worked as a test engineer at Boeing - Kent Space Center. The main objective of my project was to create automated test procedures for a space vehicle. My tests were designed to guarantee the vehicle’s performance, design, and integrity met the expectations of our customers. I focused on ensuring the vehicle and its subsystems were able to correctly respond when commanded by our test equipment.\n\nThe main purpose for this project was to ensure we prevented bugs from going to production. My test scripts were focused on the vehicles’ ability to respond to startup or shutting down specific subsystems based on different stages of assembly. I was responsible for creating test procedures based on the expected behavior received from the Mission Systems Software Department. I followed Assembly, Integration, and Test Department’s process flows to work to formally create a procedure. I leveraged mission systems software documentation and system wire harness diagrams to build out the final test scripts. Once the procedure was created, I designed the test scripts in lower environments. First, I worked in an EDU, an Engineering Development Unit. The EDU simulates the vehicle’s behavior when sending commands and telemetry points. Once scripts were exercised and approved based on the results from the EDU environment, I was able to move development to a FlatSat, a flat satellite. The FlatSat has the flight hardware that the vehicle has, except the structure that supports it. Following successful testing in lower environments, I was able to test the final product on actual flight hardware on the Satellite.\n\nAs a result of my work, we were able to prevent three major bugs from entering production. Throughout my 3 months on the project, I created 4 special test procedures. I worked with team members to conduct code reviews preventing inefficient and faulty test scripts on more than half of the test suit. I created more than 35 documents with test results for both my team members and for the end customer. Throughout the project, I learned how to coordinate with different departments when navigating Boeing’s security standards for transferring data between hardware."
        },
        {
            "time": "3:15 PM - 3:30 PM",
            "projectId": "csse-5-315",
            "title": "Volleyball Web Application",
            "studentName": "Vince Maranan",
            "studentMajor": "CSSE",
            "projectType": "Individual Project - Student Defined",
            "facultyAdvisor": "Dr. William Erdly",
            "posterLink": "./posters/csse/maranan-vince.png",
            "abstract": "In Seattle, there is a very big problem where it is very difficult to learn more and find out about volleyball events. Often times people only find out about events and regular games through word of mouth. With that, I created a volleyball web app that allows users to post information and events about volleyball. I was able to successfully design and implement the web app and deploy it online to the link of vballcapstone.vercel.app. With this site, you can sign in as a user and begin to post and view information about volleyball events and games.\n\n The website has the potential to unite and gather volleyball players from all over Washington and allow more and more people to learn more about the places hosting volleyball games. I want to unite and bring the community closer to each other. The app is very fast with load-times up to only a few seconds to gather a good number amount of data. I wanted to make the app fast and have reliable data gathering and showcasing which is how I was able to decide on the tools of my technology stack.\n\nI used Postgres with Prisma and Supabase to handle fast data storage and query. Speed is very important as there are not much volleyball events while so many players that want to play. Knowing the information faster than someone is what makes the difference between being on the court or not because everyone is very determine to play.\n\n Overall the core functionality of the design and app has been made and all that’s remaining is to add style and theme. In the future once the product is more complete with a very secure login system, data verification system and content management system, I wish to share this with the whole community."
        }              
    ]
}